/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_itoa.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sangchpa <sangchpa@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/12/30 15:01:40 by sangchpa          #+#    #+#             */
/*   Updated: 2020/12/31 17:32:57 by sangchpa         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
/*
char *ft_itoa(int n)
{

}


Parameters | #1. 변환할 정수.
Return value | 정수를 나타내는 문자열. 할당 실패시 NULL.
External functs. | malloc
Description | malloc(3)을 할당하고 인수로 받은 정수를 나타내는 문자열을 반환.
 음수 처리는 필수.
*/